<?php

class Model_cart extends Model
{

    function translite()
    {
        $tr = array(
            1 => array(
                "title" => "Корзина",
                "all_price" => "Общая сумма",
                "name" => "Имя, фамилия",
                "phone" => "Номер телефона",
                "email" => "Email",
                "shiping" => "Доставка",
                "addres_shiping" => "Точный адрес доставки",
                "oplata" => "Оплата",
                "comment" => "Комментарий к заказу",
                "order_btn" => "Заказать",
                "empty_cart" => "Корзина пуста",
                "order_succes" => "",
                "currency" => "руб",
                "td_1" => "Товар",
                "td_2" => "Название",
                "td_3" => "Описание",
                "td_4" => "Кол-во",
                "td_5" => "Стоимость заказа",
                "sum_text" => "На сумму",
                "region_type" => "Выбрать регион доставки",
                "region_0" => "Заберу со склада",
                "regions" => [
                    "region_1" => "Доставить в Ялту | 450",
                    "region_2" => "Доставить в Алушту | 450",
                    "region_3" => "Доставить в Алупку | 450",
                    "region_4" => "Доставить в Керчь | 450",
                    "region_5" => "Доставить в Бахчисарай | 450",
                    "region_6" => "Доставить в Белогорск | 450",
                    "region_7" => "Доставить в Кировское | 450",
                    "region_8" => "Доставить в Красногвардейск | 450",
                    "region_9" => "Доставить в Ленино | 450",
                    "region_10" => "Доставить в Нижнегорск | 450",
                    "region_11" => "Доставить в Первомайск | 450",
                    "region_12" => "Доставить в Раздольное | 450",
                    "region_13" => "Доставить в Советское | 450",
                    "region_14" => "Доставить в Черноморское | 450",
                    "region_15" => "Доставить в Армянск | 450",
                    "region_16" => "Доставить в Джанкой | 450",
                    "region_17" => "Доставить в Евпаторию | 450",
                    "region_18" => "Доставить в Красноперекопск | 450",
                    "region_19" => "Доставить в Саки | 450",
                    "region_20" => "Доставить в Симферополь | 450",
                    "region_21" => "Доставить в Судак | 450",
                    "region_22" => "Доставить в Феодосию | 450",
                    "region_23" => "Доставить в Севастополь | 450",
                ],
                "region_price_text" => "р. за доставку",
                "oplata_type" => "Выбрать способ оплаты",
                "oplata_0" => "Оплатить при получении",
                "oplata_1" => "Оплата на Яндекс кошелек",
                "oplata_2" => "Оплата на QIWI",
                "send_order" => "Ваш заказ находится в обработке, наши специалисты свяжутся с Вами для уточнения деталей заказа в рабочее время: с Пн по Пт: 10.00-19.00 и Сб: 10.00-17.00. Спасибо что выбрали ЕВА-Крым.рф . Будем рады видеть Вас снова.",
            ),
            2 => array(
                "title" => "Корзина",
                "all_price" => "Загальна сума",
                "name" => "Ім'я, прізвище",
                "phone" => "Номер телефону",
                "shiping" => "Доставка",
                "addres_shiping" => "Адреса доставки",
                "comment" => "Залишити повідомлення",
                "order_btn" => "Замовити",
                "empty_cart" => "Кошик порожній",
                "order_succes" => "",
                "currency" => "руб",
                "td_1" => "Товар",
                "td_2" => "Назва",
                "td_3" => "Опис",
                "td_4" => "Кіль-сть",
                "td_5" => "Вартість замовлення",
                "sum_text" => "Сума замовлення",
                "region_type" => "Оберіть свій регіон доставки",
                "region_0" => "Заберу на складі",
                "regions" => [
                     "region_1" => "Доставить в Ялту | 450",
                    "region_2" => "Доставить в Алушту | 450",
                    "region_3" => "Доставить в Алупку | 450",
                    "region_4" => "Доставить в Керчь | 450",
                    "region_5" => "Доставить в Бахчисарай | 450",
                    "region_6" => "Доставить в Белогорск | 450",
                    "region_7" => "Доставить в Кировское | 450",
                    "region_8" => "Доставить в Красногвардейск | 450",
                    "region_9" => "Доставить в Ленино | 450",
                    "region_10" => "Доставить в Нижнегорск | 450",
                    "region_11" => "Доставить в Первомайск | 450",
                    "region_12" => "Доставить в Раздольное | 450",
                    "region_13" => "Доставить в Советское | 450",
                    "region_14" => "Доставить в Черноморское | 450",
                    "region_15" => "Доставить в Армянск | 450",
                    "region_16" => "Доставить в Джанкой | 450",
                    "region_17" => "Доставить в Евпаторию | 450",
                    "region_18" => "Доставить в Красноперекопск | 450",
                    "region_19" => "Доставить в Саки | 450",
                    "region_20" => "Доставить в Симферополь | 450",
                    "region_21" => "Доставить в Судак | 450",
                    "region_22" => "Доставить в Феодосию | 450",
                    "region_23" => "Доставить в Севастополь | 450",
                ],
                "region_price_text" => "р. за доставку",
                "oplata_type" => "Вибрати спосіб оплати",
                "oplata_0" => "Оплатити при отриманні",
                "oplata_1" => "Оплатити на Яндекс гроші",
                "oplata_2" => "Оплатити на QIWI",
                "send_order" => "Ваше замовлення знаходиться в обробці, наші фахівці зв'яжуться з Вами для уточнення деталей замовлення в робочий час: з Пн по Пт: 10.00-19.00 і Сб: 10.00-17.00. Спасибі що вибрали Єва-Крим. рф . Будемо раді бачити вас знову.",
            ),
            3 => array(
                "title" => "Кәрзин",
                "all_price" => "Тулы сумма",
                "name" => "Исем Фамилия",
                "phone" => "Телефон номеры",
                "shiping" => "Тапшыру",
                "addres_shiping" => "Китерү адресы",
                "comment" => "Хәбәр калдыру",
                "order_btn" => "Заказ бирү",
                "empty_cart" => "Арба буш",
                "order_succes" => "",
                "currency" => "руб",
                "td_1" => "Продукция",
                "td_2" => "Исем",
                "td_3" => "Тасвирлау",
                "td_4" => "Кол-во",
                "td_5" => "Заказ бәясе",
                "sum_text" => "Заказ бәясе",
                "region_type" => "Тапшыру өлкәсен сайлагыз",
                "region_0" => "",
                "regions" => [
                     "region_1" => "Доставить в Ялту | 450",
                    "region_2" => "Доставить в Алушту | 450",
                    "region_3" => "Доставить в Алупку | 450",
                    "region_4" => "Доставить в Керчь | 450",
                    "region_5" => "Доставить в Бахчисарай | 450",
                    "region_6" => "Доставить в Белогорск | 450",
                    "region_7" => "Доставить в Кировское | 450",
                    "region_8" => "Доставить в Красногвардейск | 450",
                    "region_9" => "Доставить в Ленино | 450",
                    "region_10" => "Доставить в Нижнегорск | 450",
                    "region_11" => "Доставить в Первомайск | 450",
                    "region_12" => "Доставить в Раздольное | 450",
                    "region_13" => "Доставить в Советское | 450",
                    "region_14" => "Доставить в Черноморское | 450",
                    "region_15" => "Доставить в Армянск | 450",
                    "region_16" => "Доставить в Джанкой | 450",
                    "region_17" => "Доставить в Евпаторию | 450",
                    "region_18" => "Доставить в Красноперекопск | 450",
                    "region_19" => "Доставить в Саки | 450",
                    "region_20" => "Доставить в Симферополь | 450",
                    "region_21" => "Доставить в Судак | 450",
                    "region_22" => "Доставить в Феодосию | 450",
                    "region_23" => "Доставить в Севастополь | 450",
                ],
                "region_price_text" => "р. китерү өчен",
                "oplata_type" => "Түләү ысулын сайлагыз",
                "oplata_0" => "Квитанциядән соң түләгез",
                "oplata_1" => "Түләү на Яндекс кошелек",
                "oplata_2" => "Түләү на QIWI",
                "send_order" => "Сезнең заказ эшкәртелә, безнең белгечләр эш вакытында заказның детальләрен төгәлләү өчен Сезнең белән элемтәгә керәчәк: Пндан Птга кадәр: 10.00-19.00 һәм Сб: 10.00-17.00. ЕВА-Кырым.рф сайлаганыгыз өчен рәхмәт . Сезне кабат күрергә шат булырбыз.",
            ),
        );
        return $tr[LG];
    }

    function getProd($id)
    {
        $sql = "SELECT cat_id,id,title_" . $this->getLG(LG) . " as title,text_" . $this->getLG(LG) . " as text,img,price,time FROM services WHERE id = " . $id;
        $arr = $this->query($sql);
        return $arr[0];
    }

    function getCarImg($id)
    {
        $sql = "SELECT car FROM model WHERE id = " . $id;
        $arr = $this->query($sql);
        return $arr[0]['car'];
    }
    
    function addToOrders($number, $date, $fio, $car, $delivery, $pay, $email, $phone, $price, $text){
        $sql = "INSERT INTO `orders` VALUES (NULL, ".$number.",'".$date."','".$fio."','".$car."','".$delivery."','".$pay."','".$email."','".$phone."',".$price.",'".$text."',".time().")";
        $result = $this->query($sql); 
        
        $fp = fopen("test.txt", "w+");
        fputs($fp, $sql);
        fclose($fp);
        
        return 1;
    }
    
    function numberOrder(){
        $sql = "SELECT id FROM orders order by id desc limit 1";
        $arr = $this->query($sql);
        
        return (1678 + $arr[0]['id']);
    }

    function getSaleDay() {
        $id = date( "N" );
        $sql = "SELECT `value` FROM saleday WHERE id = " . $id;
        $arr = $this->query($sql);
        return $arr[0]['value'];
    }
}