<?php

class Model_about extends Model{

   function translite() {
      $tr = array(
            1 => array(
                "atvantage_title" => "ПРЕИМУЩЕСТВА КОВРИКОВ EVAtuning",
                "atvantage_sub_title" => "Автомобильные коврики, которые послужат вам дольше, чем вы себе от них ожидаете.",
                "atvantage_text_1" => "Автомобильные коврики EVAtuning производятся в Крыму. Выдерживают температурный режим до +/- 60 градусов Цельсия и остаются эластичными.",
                "atvantage_text_2" => "Экологически чистое сырье, благодаря которым неприятный запах, независимо от погоды, никогда не появится в машине. ",
                "atvantage_text_3" => "Любой мусор, вода, снег и пыль попадают в ячейки, оставаясь там до тех пор, пока Вы не вытряхните коврики.",

                "working_title" => "Как мы работаем",
                "working_item_1" => "Осуществляется предварительный заказ на сайте ",
                "working_item_2" => "Наш сотрудник звонит Вам",
                "working_item_3" => "Заказ доставляется клиенту",
                "working_item_4" => "Заказ оплачивается при получении или on-line",

                "select_title" => "Причины выбрать нас",
                "select_item_1_title" => "ШИРОКИЙ МОДЕЛЬНЫЙ РЯД",
                "select_item_1_text" => "Более 350шт. цветовых и форменных комбинаций ковриков для одного автомобиля. Заказы принимаются на все типы автомобилей и желаемого цвета по каталогу EVAtuning.",
                "select_item_2_title" => "ТОЧНОСТЬ В ПРОИЗВОДСТВЕ",
                "select_item_2_text" => "Правильно снятые лекала залог качества. Наши мастера шьют коврики точно по размерам салона и багажного отделения автомобиля, благодаря чему покрывается весь пол.",
                "select_item_3_title" => "СЕРТИФИЦИРОВАНОЕ СЫРЬЕ",
                "select_item_3_text" => "Толщина коврика EVAtuning составляет 10 мм. Они очень прочные, эластичные и легкие. Изготовлены из специального и сертифицированного сырья ─ этиленвинилацетатом (ЭВА).",
            ),
            2 => array(
                "atvantage_title" => "ПЕРЕВАГИ КИЛИМІВ EVAtuning",
                "atvantage_sub_title" => "Автомобільні килимки, які послужать вам довше, ніж ви собі від них очікуєте.",
                "atvantage_text_1" => "Автомобільні килимки EVAtuning виробляються в Криму. Витримують температурний режим до +/- 60 градусів Цельсія і залишаються еластичними.",
                "atvantage_text_2" => "Екологічно чиста сировина, завдяки яким неприємний запах, незалежно від погоди, ніколи не з'явиться в машині. ",
                "atvantage_text_3" => "Будь-яке сміття, вода, сніг і пил потрапляють в осередку, залишаючись там до тих пір, доки Ви не витрусити килимки.",

                "working_title" => "Як ми працюємо",
                "working_item_1" => "Здійснюється попереднє замовлення на сайті ",
                "working_item_2" => "Наш співробітник дзвонить Вам",
                "working_item_3" => "Замовлення доставляється клієнту",
                "working_item_4" => "Замовлення оплачується при отриманні або on-line",

                "select_title" => "Чому саме у нас",
                "select_item_1_title" => "ШИРОКИЙ МОДЕЛЬНИЙ РЯД",
                "select_item_1_text" => "Замовлення приймаються на всі типи автомобілів і бажаного кольору по каталогу EVAtuning.",
                "select_item_2_title" => "ТОЧНІСТЬ У ВИРОБНИЦТВІ",
                "select_item_2_text" => "Наші майстри шиють килимки точно за розмірами салону і багажного відділення автомобіля, завдяки чому покривається вся підлога.",
                "select_item_3_title" => "СЕРТИФІКОВУВАНА СИРОВИНА",
                "select_item_3_text" => "Товщина килима Eva становить 10 мм. Вони дуже міцні, еластичні і легкі. Виготовлені зі спеціального сировини ─ етилен-вінілацетату (ЕВА).",
            ),
            3 => array(
                "atvantage_title" => "EVAtuning карпетларның өстенлекләре",
                "atvantage_sub_title" => "Автомобиль идәннәре сез көткәннән озаграк дәвам итә.",
                "atvantage_text_1" => "EVAtuning машиналары Кырымда җитештерелә, ярылмый, формасын сакла һәм салкын һавада эластик булып кала.",
                "atvantage_text_2" => "Экологик чиста чимал, шуның аркасында машинада күңелсез ис, беркайчан да күренмәячәк. ",
                "atvantage_text_3" => "Теләсә нинди чүп-чар, су, кар һәм тузан күзәнәкләргә төшәләр, келәмнәрне селкеткәнче шунда калалар.",

                "working_title" => "Ничек эшлибез",
                "working_item_1" => "Алдан заказ бирү сайтта башкарыла ",
                "working_item_2" => "Безнең хезмәткәр сезгә шалтырата",
                "working_item_3" => "Заказ клиентка бирелә",
                "working_item_4" => "Заказ алынганнан соң яки он-лайн түләнә",

                "select_title" => "Безне сайларга сәбәпләр",
                "select_item_1_title" => "Киң киңлек",
                "select_item_1_text" => "Заказлар барлык төр машиналар һәм каталогтан кирәкле төсләр өчен кабул ителә EVAtuning.",
                "select_item_2_title" => "ODитештерүдә карар",
                "select_item_2_text" => "Безнең һөнәрчеләр келәмне машинаның эчке һәм багаж бүлмәләренең үлчәмнәренә кадәр тегәләр, бөтен идән каплансын өчен.",
                "select_item_3_title" => "Сертификатланган чимал материаллары",
                "select_item_3_text" => "Эва келәменең калынлыгы 10 мм. Алар бик көчле, эластик һәм җиңел. Махсус чималдан ясалган ─ этилен винил asetat (EVA).",
            ),
        );
        return $tr[LG];
   }

   function getText(){
      $sql = "SELECT text_".$this->getLG()." as text FROM text_page WHERE id = 1";
      $arr = $this->query($sql);
      return $arr[0];
   }

   function getStaff(){
      $sql = "SELECT id,name_".$this->getLG()." as name, position_".$this->getLG()." as position,img FROM staff";
      $arr = $this->query($sql);
      return $arr;
   }

   function getStaffSingle($id){
     $sql = "SELECT id,text_".$this->getLG()." as text,name_".$this->getLG()." as name, position_".$this->getLG()." as position,img FROM staff WHERE id = ".$id;
     $arr = $this->query($sql);
     return $arr[0];
  }

    function getPartners()
    {
        $sql = "SELECT * FROM partners ORDER BY pos";
        $arr = $this->query($sql);
        return $arr;
    }

    function getShowPartners(){
        $sql = "SELECT value FROM config WHERE id = 1";
        $arr = $this->query($sql);
        return $arr[0]['value'];
    }

}