<?php

class Model_feedback extends Model
{
    function translite()
    {
        $tr = array(
            1 => array(
                "title" => "Условия возврата",
                "category_title" => "Автомобильные коврики EVAtuning",
                "category_other" => "Другое",
                "feedback_sub_title" => "Возврат товара",
                "feedback_text_1" => "Возврат и обмен приобретенного товара осуществляется при неточности размеров коврика. Мы хотели бы обратить Ваше внимание, что возврат товара возможен при соблюдении следующих условий:",
                "feedback_text_2" => "Убедитесь, что Вы правильно установили коврики в салоне автомобиля. В большинстве случаев наши  специалисты  подскажут  правильный способ установки и проблема решается сама собой, товар должен иметь надлежащий вид: сохранена его упаковка, на ковриках не должно быть видно следов эксплуатации.",
                "feedback_text_3" => "Более подробную информацию по оформлению возврата можно получить по номеру:",
            ),
            2 => array(
                "title" => "Умови повернення",
                "category_title" => "Автомобільні килимки EVAtuning",
                "category_other" => "Інше",
                "feedback_sub_title" => "Повернення товару",
                "feedback_text_1" => "Повернення і обмін придбаного товару здійснюється за неточності розмірів килимка. Ми хотіли б звернути Вашу увагу, що повернення товару можливий при дотриманні наступних умов:",
                "feedback_text_2" => "Переконайтеся, що Ви правильно встановили килимки в салоні автомобіля. У більшості випадків наші фахівці підкажуть правильний спосіб установки і проблема вирішується сама собою, товар повинен мати належний вигляд: збережена його упаковка, на килимках не повинно бути видно слідів експлуатації.",
                "feedback_text_3" => "Більш детальну інформацію з оформлення повернення можна отримати за номером:",
            ),
            3 => array(
                "title" => "Кайту шартлары",
                "category_title" => "EVAtuning машинасы",
                "category_other" => "Бүтәннәр",
                "feedback_sub_title" => "Сатып алу кире кайта",
                "feedback_text_1" => "Сатып алынган товарларны кайтару һәм алыштыру келәмнең зурлыгы дөрес булмаса башкарыла. Без сезнең игътибарыгызны товарны кире кайтару мөмкин булган фактка юнәлтәбез:",
                "feedback_text_2" => "Машина түшәкләренә дөрес туры килүегезне тикшерегез. Күпчелек очракта, безнең белгечләр дөрес урнаштыру ысулын тәкъдим итәрләр һәм проблема үзе хәл ителер, продуктның тышкы кыяфәте булырга тиеш: аның упаковкасы сакланган, келәмдә куллану эзләре күренергә тиеш түгел.",
                "feedback_text_3" => "Кайту эшкәртү турында тулырак мәгълүматны шалтыратып алырга мөмкин:",
            ),
        );
        return $tr[LG];
    }

    function getMan(){
        $sql = "SELECT * FROM manufacture ORDER BY pos";
        $arr = $this->query($sql);
        return $arr;
    }
}