<?php

class Model_home extends Model
{

    function translite()
    {
        $tr = array(
            1 => array(
                "slider_1_title" => "Автомобильные коврики EVAtuning от производителя ЕВА-Крым.рф",
                "slider_1_text" => "Экологически чистое сырье",
                "slider_2_title" => "Хочешь стать дилером? Регистрируйся и добро пожаловать в команду",
                "slider_2_text" => "Работаем во всех регионах Крыма",
                "slider_3_title" => "Заказать коврики EVAtuning можно on-line в соцсетях или по телефону",
                "slider_3_text" => "Быстро оформить и получить заказ за 24 часа",
                "slider_btn_1" => "КАТАЛОГ",
                "slider_btn_2" => "БЫСТРЫЙ ЗАКАЗ",

                "category_title" => "Выберите свой коврик в каталоге производителя ЕВА-Крым.рф",
                "category_sub_title" => "Подбор ковриков по марке автомобиля ",

                "atvantage_title" => "ПРЕИМУЩЕСТВА КОВРИКОВ EVAtuning",
                "atvantage_sub_title" => "Автомобильные коврики, которые послужат вам дольше, чем вы себе от них ожидаете.",
                "atvantage_text_1" => "Автомобильные коврики EVAtuning производятся в Крыму, не трескаются, держат форму и остаются эластичными в морозы.",
                "atvantage_text_2" => "Экологически чистое сырье, благодаря которым неприятный запах, независимо от погоды, никогда не появится в машине. ",
                "atvantage_text_3" => "Любой мусор, вода, снег и пыль попадают в ячейки, оставаясь там до тех пор, пока Вы не вытряхните коврики.",

                "working_title" => "Как мы работаем",
                "working_item_1" => "Осуществляется предварительный заказ на сайте ",
                "working_item_2" => "Наш сотрудник звонит Вам",
                "working_item_3" => "Заказ доставляется клиенту",
                "working_item_4" => "Заказ оплачивается при получении или on-line",

                "select_title" => "Причины выбрать нас",
                "select_item_1_title" => "КОМФОРТ",
                "select_item_1_text" => "Заказы принимаются на все типы автомобилей и желаемого цвета по каталогу EVAtuning.",
                "select_item_2_title" => "ТОЧНОСТЬ",
                "select_item_2_text" => "Наши мастера шьют коврики точно по размерам салона и багажного отделения автомобиля, благодаря чему покрывается весь пол.",
                "select_item_3_title" => "ДОВЕРИЕ",
                "select_item_3_text" => "Толщина ковра Eva составляет 10 мм. Они очень прочные, эластичные и легкие. Изготовлены из специального сырья ─ этилен-винилацетатом (ЭВА).",

                "review_title" => "Отзывы наших клиентов",
                "order" => "Заказать",
                "dram" => "драм",
                "category_other" => "Другое",
            ),
            2 => array(
                "slider_1_title" => "Автомобільні килимки EVAtuning від виробника ЕВА-Крим.рф",
                "slider_1_text" => "Екологічно чиста сировина",
                "slider_2_title" => "Хочеш стати дилером? Реєструйся та ласкаво просимо в команду.",
                "slider_2_text" => "Працюємо в усіх регіонах Криму",
                "slider_3_title" => "Замовити килимки EVAtuning можна on-line в соцмережах або по телефону",
                "slider_3_text" => "Швидко оформити і отримати замовлення за 24 години",
                "slider_btn_1" => "КАТАЛОГ",
                "slider_btn_2" => "ШВИДКЕ ЗАМОВЛЕННЯ",

                "category_title" => "Виберіть свій килимок в каталозі виробника ЕВА-Крим.рф",
                "category_sub_title" => "Підбір килимків по марці автомобіля",

                "atvantage_title" => "ПЕРЕВАГИ КИЛИМІВ EVAtuning",
                "atvantage_sub_title" => "Автомобільні килимки, які послужать вам довше, ніж ви собі від них очікуєте.",
                "atvantage_text_1" => "Автомобільні килимки EVAtuning виробляються в Криму. Витримують температурний режим до +/- 60 градусів Цельсія і залишаються еластичними.",
                "atvantage_text_2" => "Екологічно чиста сировина, завдяки яким неприємний запах, незалежно від погоди, ніколи не з'явиться в машині. ",
                "atvantage_text_3" => "Будь-яке сміття, вода, сніг і пил потрапляють в осередку, залишаючись там до тих пір, доки Ви не витрусити килимки.",

                "working_title" => "Як ми працюємо",
                "working_item_1" => "Здійснюється попереднє замовлення на сайті ",
                "working_item_2" => "Наш співробітник дзвонить Вам",
                "working_item_3" => "Замовлення доставляється клієнту",
                "working_item_4" => "Замовлення оплачується при отриманні або on-line",

                "select_title" => "Чому саме у нас",
                "select_item_1_title" => "ШИРОКИЙ МОДЕЛЬНИЙ РЯД",
                "select_item_1_text" => "Замовлення приймаються на всі типи автомобілів і бажаного кольору по каталогу EVAtuning.",
                "select_item_2_title" => "ТОЧНІСТЬ У ВИРОБНИЦТВІ",
                "select_item_2_text" => "Наші майстри шиють килимки точно за розмірами салону і багажного відділення автомобіля, завдяки чому покривається вся підлога.",
                "select_item_3_title" => "СЕРТИФІКОВУВАНА СИРОВИНА",
                "select_item_3_text" => "Товщина килима Eva становить 10 мм. Вони дуже міцні, еластичні і легкі. Виготовлені зі спеціального сировини ─ етилен-вінілацетату (ЕВА).",

                "review_title" => "Відгуки наших клієнтів",
                "order" => "Замовити",
                "dram" => "рубль",
                "category_other" => "Інше",
            ),
            3 => array(
                "slider_1_title" => "Автомобиль келәмнәре EVA-Krym.rf җитештерүчедән",
                "slider_1_text" => "Экологик чиста чимал",
                "slider_2_title" => "Сез дилер булырга телисезме? Коллективка теркәлегез һәм рәхим итегез",
                "slider_2_text" => "Без Кырымның барлык төбәкләрендә эшлибез",
                "slider_3_title" => "Сез EVAtuning келәмнәрен он-лайн социаль челтәрләрдә яки телефон аша заказлый аласыз",
                "slider_3_text" => "24 сәгать эчендә тиз урнаштырыгыз һәм заказ алыгыз",
                "slider_btn_1" => "КАТАЛОГ",
                "slider_btn_2" => "СОРАУ",

                "category_title" => "EVA-Crimea.rf җитештерүче каталогында келәмне сайлагыз",
                "category_sub_title" => "Машина ясау белән келәмнәрне сайлау",

                "atvantage_title" => "EVAtuning карпетларның өстенлекләре",
                "atvantage_sub_title" => "Автомобиль идәннәре сез көткәннән озаграк дәвам итә.",
                "atvantage_text_1" => "EVAtuning машиналары Кырымда җитештерелә, ярылмый, формасын сакла һәм салкын һавада эластик булып кала.",
                "atvantage_text_2" => "Экологик чиста чимал, шуның аркасында машинада күңелсез ис, беркайчан да күренмәячәк. ",
                "atvantage_text_3" => "Теләсә нинди чүп-чар, су, кар һәм тузан күзәнәкләргә төшәләр, келәмнәрне селкеткәнче шунда калалар.",

                "working_title" => "Ничек эшлибез",
                "working_item_1" => "Алдан заказ бирү сайтта башкарыла ",
                "working_item_2" => "Безнең хезмәткәр сезгә шалтырата",
                "working_item_3" => "Заказ клиентка бирелә",
                "working_item_4" => "Заказ алынганнан соң яки он-лайн түләнә",

                "select_title" => "Безне сайларга сәбәпләр",
                "select_item_1_title" => "Киң киңлек",
                "select_item_1_text" => "Заказлар барлык төр машиналар һәм каталогтан кирәкле төсләр өчен кабул ителә EVAtuning.",
                "select_item_2_title" => "ODитештерүдә карар",
                "select_item_2_text" => "Безнең һөнәрчеләр келәмне машинаның эчке һәм багаж бүлмәләренең үлчәмнәренә кадәр тегәләр, бөтен идән каплансын өчен.",
                "select_item_3_title" => "Сертификатланган чимал материаллары",
                "select_item_3_text" => "Эва келәменең калынлыгы 10 мм. Алар бик көчле, эластик һәм җиңел. Махсус чималдан ясалган ─ этилен винил asetat (EVA).",

                "review_title" => "Безнең клиентлардан җавап",
                "order" => "Заказ бирү",
                "dram" => "рубль",
                "category_other" => "Бүтәннәр",
            ),
        );
        return $tr[LG];
    }

    function getMan(){
        $sql = "SELECT * FROM manufacture ORDER BY title";
        $arr = $this->query($sql);
        return $arr;
    }
}

//getLG