<?php

class Model_shipping extends Model
{

    function translite()
    {
        $tr = array(
            1 => array(
                "title" => "Доставка и оплата",
                "category_title" => "Автомобильные коврики EVAtuning",
                "category_other" => "Другое",
                "shipping_sub_title_1" => "Доставка",
                "shipping_text_1" => "Доставка осуществляется по всей территории АР Крым, оплата производится только в рублях. Доставка в течение 24 часов по Севастополю, Симферополю и Ялте а также самовывоз",
                "shipping_text_2" => "Выбрать регион доставки можно в корзине при заказе. Способ доставки или ТК Вы можете указать в комментарии к заказу или выбрать из списка.",
                "shipping_text_3" => "Средняя стоимость доставки в регионы 200 рублей",
                "shipping_text_4" => "Мы работаем каждый день. Задержка доставки возможна в случае непредсказуемых случаев, которые произошли независимо от нашей воли. В этом случае наш сотрудник свяжется с Вам и сообщит об изменении срока доставки.",
                "shipping_sub_title_2" => "Оплата",
                "shipping_text_5" => "Оплатить коврики или другой товар Вы можете on-line или  в момент получения заказа. Клиент может открыть товар на месте, проверить  размер, качественные характеристики, а затем оплатить. Так же выбрать способ оплаты можно в корзине при заказе. Способ оплаты Вы можете указать в комментарии к заказу или выбрать из списка.",
                "shipping_text_6" => "Спасибо что воспользовались нашими услугами. Вы можете оформить новый заказ или связаться с нами по следующему номеру телефона:",
            ),
            2 => array(
                "title" => "Доставка і оплата",
                "category_title" => "Автомобільні килимки EVAtuning",
                "category_other" => "Інше",
                "shipping_sub_title_1" => "Доставка",
                "shipping_text_1" => "Доставка здійснюється по всій території АР Крим, оплата проводиться тільки в рублях. Доставка протягом 24 годин по Севастополю, Сімферополю і Ялті.",
                "shipping_text_2" => "Оберіть свій регіон доставки можна в кошику при замовленні. Спосіб доставки або ТК Ви можете вказати в коментарі до замовлення або вибрати зі списку.",
                "shipping_text_3" => "Середня вартість доставки в регіони 200 рублів",
                "shipping_text_4" => "Ми працюємо кожен день. Затримка доставки можлива в разі непередбачуваних випадків, які сталися незалежно від нашої волі. У цьому випадку наш співробітник зв'яжеться з Вам і повідомить про зміну терміну доставки.",
                "shipping_sub_title_2" => "Оплата",
                "shipping_text_5" => "Оплатити килимки або інший товар Ви можете on-line або в момент отримання замовлення. Клієнт може відкрити товар на місці, перевірити розмір, якісні характеристики, а потім оплатити. Так само вибрати спосіб оплати можна в кошику при замовленні. Спосіб оплати Ви можете вказати в коментарі до замовлення або вибрати зі списку.",
                "shipping_text_6" => "Дякую що скористалися нашими послугами. Ви можете оформити нове замовлення або зв'язатися з нами за наступним номером телефону:",
            ),
            3 => array(
                "title" => "Тапшыру һәм түләү",
                "category_title" => "EVAtuning машинасы",
                "category_other" => "Бүтәннәр",
                "shipping_sub_title_1" => "Тапшыру",
                "shipping_text_1" => "Тапшыру Кырым Автономияле Республикасы территориясендә алып барыла, түләү бары тик суммада гына башкарыла. 24 сәгать эчендә Севастополь, Симферополь һәм Ялта аша китерү.",
                "shipping_text_2" => "Заказ биргәндә сез кәрзиндә китерү өлкәсен сайлый аласыз. Сез заказдагы аңлатмаларда тапшыру ысулын яки TC күрсәтә аласыз яки исемлектән сайлый аласыз.",
                "shipping_text_3" => "Төбәкләргә китерүнең уртача бәясе 200 руб",
                "shipping_text_4" => "Без көн саен эшлибез. Тоткарлану, безнең ихтыярга карамастан, көтелмәгән вакыйгалар булган очракта мөмкин. Бу очракта безнең хезмәткәр сезнең белән элемтәгә керәчәк һәм тапшыру вакытындагы үзгәрешләр турында хәбәр итәчәк.",
                "shipping_sub_title_2" => "Түләү",
                "shipping_text_5" => "Сез келәм яки бүтән товар өчен он-лайн яки заказ алган вакытта түли аласыз. Клиент продуктны урында ача, зурлыгын, сыйфат үзенчәлекләрен тикшерә, аннары түли ала. Заказ биргәндә сез кәрзиндә түләү ысулын сайлый аласыз. Сез аңлатмада түләү ысулын заказга күрсәтә аласыз яки исемлектән сайлый аласыз.",
                "shipping_text_6" => "Безнең хезмәтләрне кулланган өчен рәхмәт. Сез яңа заказ урнаштыра аласыз яки түбәндәге телефон номерында безнең белән элемтәгә керә аласыз:",
            ),
        );
        return $tr[LG];
    }

    function getMan(){
        $sql = "SELECT * FROM manufacture ORDER BY pos";
        $arr = $this->query($sql);
        return $arr;
    }


}